---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterElement
source: html/821370bd-70b2-8673-ebd4-9eff5fe9a2f9.htm
---
# FilterElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.